EDT/УТ/src/Documents/ВводДанныхОСостоянииЗаказа/ВводДанныхОСостоянииЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводДанныхОСостоянииЗаказа</name>
  <registerRecords>InformationRegister.СостоянияЗаказов</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>BusinessProcessRef.новаРейсМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНевыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплатыДо</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплатыПосле</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СформированАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьДвиженияПоСостояниюЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/новаЗаданияРейсов/новаЗаданияРейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаЗаданияРейсов</name>
  <resources>
    <name>Вид</name>
    <type>
      <types>EnumRef.новаВидыЗаданийРейсаМестнойДоставки</types>
    </type>
  </resources>
  <resources>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </resources>
  <resources>
    <name>ЗаданиеВыполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаданиеВыполненоВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>BusinessProcessRef.новаРейсМестнойДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодТочки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МаршрутСопровождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/новаВидыЗаданийРейсаМестнойДоставки/новаВидыЗаданийРейсаМестнойДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>новаВидыЗаданийРейсаМестнойДоставки</name>
  <enumValues>
    <name>Погрузка</name>
  </enumValues>
  <enumValues>
    <name>Разгрузка</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/ВводДанныхОСостоянииЗаказа/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПолучитьДанныеЭкипажа();
КонецПроцедуры

Процедура ПолучитьДанныеЭкипажа()
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	новаЗаданияРейсов.Рейс,
	            |	новаЗаданияРейсов.Рейс.Транспорт КАК Транспорт,
	            |	новаЗаданияРейсов.Рейс.Водитель КАК Водитель,
	            |	новаЗаданияРейсов.Рейс.Экспедитор КАК Экспедитор,
	            |	ТипыОплат.Ссылка КАК ТипОплатыДо,
	            |	ТипыОплат.Ссылка КАК ТипОплатыПосле
	            |ИЗ
	            |	РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
	            |			ПО РеализацияТоваровУслуг.ТипОплаты = ТипыОплат.Код
	            |		ПО новаЗаданияРейсов.Доставка.Номер = РеализацияТоваровУслуг.Номер
	            |ГДЕ
	            |	новаЗаданияРейсов.МаршрутСопровождения = ЛОЖЬ
	            |	И новаЗаданияРейсов.Вид = ЗНАЧЕНИЕ(Перечисление.новаВидыЗаданийРейсаМестнойДоставки.разгрузка)
	            |	И новаЗаданияРейсов.Доставка.Номер = &Доставка
	            |	И новаЗаданияРейсов.Рейс.РейсОтменен = ЛОЖЬ
	            |	И новаЗаданияРейсов.Рейс.РейсВыполнен = ЛОЖЬ
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	новаЗаданияРейсов.Рейс,
	            |	новаЗаданияРейсов.Рейс.Транспорт,
	            |	новаЗаданияРейсов.Рейс.Водитель,
	            |	новаЗаданияРейсов.Рейс.Экспедитор,
	            |	ТипыОплат.Ссылка,
	            |	ТипыОплат.Ссылка
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	новаЗаданияРейсов.Рейс.Дата УБЫВ";
				
	Зап.УстановитьПараметр("Доставка", Объект.Заказ.Номер);	
	Рез = Зап.Выполнить().Выгрузить();
	Если Рез.количество() >= 1 Тогда
		ЗаполнитьЗначенияСвойств(Объект, Рез[0]);
	Иначе
		Объект.Рейс = "";
		Объект.Транспорт = "";
		Объект.Водитель = "";
		Объект.Экспедитор = "";
		Объект.ТипОплатыДо = "";
		Объект.ТипОплатыПосле = "";
	КонецеСли;
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ГруппаТипОплаты.Доступность = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ПравоМенятьТипОплаты");
	Элементы.ТипОплатыДо.Доступность = Ложь;
	Элементы.ГруппаТипОплаты.Доступность = Ложь;
	
	если Объект.Оператор.Пустая() Тогда
		Объект.Оператор = ПараметрыСеанса.ТекущийПользователь;
	КонецеСли;	
	
	Если Объект.СформированАвтоматически Тогда
		ТолькоПросмотр = Истина;
	КонецеСли;	
КонецПроцедуры
